InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытияЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОткрытияЛицевыхСчетовСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>АПК:58 физлицо является сотрудником</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗарплатныйПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗарплатныеПроекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыВыплатыПособия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыВыплатыПособия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаКартуМИР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовымПереводом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнаяОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗарплатныеПроекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЗарплатныеПроекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭлектронныйДокументооборотСБанком</Name>
					<Comment>При использовании, факт оплаты банком платежных ведомостей регистрируется в системе при загрузке файла подтверждения из банка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодировкаФайловОбменаПоЗарплатномуПроекту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделениеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Comment>АПК:1205 Фиксированная строка, т.к. длина счета в РФ - ровно 20 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтделенияБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыФайловОбменаПоЗарплатномуПроекту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаИмениДержателяКарты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СистемыРасчетовПоБанковскимКартам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СистемаРасчетовПоБанковскимКартам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СпособыПрямыхВыплатФССРасширенный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОпределенииСпособовПрямыхВыплат(ТипыСпособов) Экспорт
	
	ОписаниеСпособа = ТипыСпособов.Добавить();
	ОписаниеСпособа.ИмяТипа   = "СправочникСсылка.БанковскиеСчетаКонтрагентов";
	ОписаниеСпособа.Заголовок = НСтр("ru = 'На банковский счет'");
	ОписаниеСпособа.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк;
	
КонецПроцедуры

Процедура ПриОпределенииЗарплатныхПроектовИБанковскихСчетов(ФизическиеЛица, БанковскиеРеквизиты) Экспорт
	СтандартнаяОбработка = Ложь;
	Разрешенные = Ложь;
	Организация = Неопределено;
	Дата = ТекущаяДатаСеанса();
	КадровыеДанные = "Организация, ФизическоеЛицо, МестоВыплаты";
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(МенеджерВТ, Разрешенные, ФизическиеЛица, Организация, Дата, Дата);
	ИмяВТ     = "ВТОсновныеСотрудникиФизическихЛиц";
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВТ, ИмяВТ);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Разрешенные, КадровыеДанные);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.МестоВыплаты КАК МестоВыплаты,
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТМестаВыплатыЗарплатныеПроекты
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК Сотрудники
	|ГДЕ
	|	Сотрудники.МестоВыплаты ССЫЛКА Справочник.ЗарплатныеПроекты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.МестоВыплаты КАК МестоВыплаты,
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТМестаВыплатыБанковскиеСчета
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК Сотрудники
	|ГДЕ
	|	Сотрудники.МестоВыплаты ССЫЛКА Справочник.БанковскиеСчетаКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатныеПроекты.Ссылка КАК Значение,
	|	ЗарплатныеПроекты.Представление КАК ПредставлениеЗначения,
	|	ЗарплатныеПроекты.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗарплатныеПроекты.Банк КАК Банк,
	|	ЛицевыеСчета.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЛицевыеСчета.НомерЛицевогоСчета КАК НомерСчета,
	|	ЛицевыеСчета.ДатаОткрытияЛицевогоСчета КАК ДатаОткрытияСчета,
	|	ЛицевыеСчета.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА МестаВыплаты.МестоВыплаты ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяМестомВыплатыЗарплаты
	|ПОМЕСТИТЬ ВТИтогиБезБИК
	|ИЗ
	|	РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗарплатныеПроекты КАК ЗарплатныеПроекты
	|		ПО ЛицевыеСчета.ЗарплатныйПроект = ЗарплатныеПроекты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаВыплатыЗарплатныеПроекты КАК МестаВыплаты
	|		ПО ЛицевыеСчета.ФизическоеЛицо = МестаВыплаты.ФизическоеЛицо
	|			И ЛицевыеСчета.ЗарплатныйПроект = МестаВыплаты.МестоВыплаты
	|			И ЛицевыеСчета.Организация = МестаВыплаты.Организация
	|ГДЕ
	|	ЛицевыеСчета.ФизическоеЛицо В(&ФизическиеЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.Ссылка,
	|	БанковскиеСчетаКонтрагентов.Представление,
	|	БанковскиеСчетаКонтрагентов.ПометкаУдаления,
	|	БанковскиеСчетаКонтрагентов.Банк,
	|	БанковскиеСчетаКонтрагентов.Владелец,
	|	БанковскиеСчетаКонтрагентов.НомерСчета,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(МестаВыплаты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА МестаВыплаты.МестоВыплаты ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаВыплатыБанковскиеСчета КАК МестаВыплаты
	|		ПО БанковскиеСчетаКонтрагентов.Владелец = МестаВыплаты.ФизическоеЛицо
	|			И БанковскиеСчетаКонтрагентов.Ссылка = МестаВыплаты.МестоВыплаты
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.Владелец В(&ФизическиеЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИтогиБезБИК.Значение КАК Значение,
	|	ВТИтогиБезБИК.ПредставлениеЗначения КАК ПредставлениеЗначения,
	|	ВТИтогиБезБИК.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТИтогиБезБИК.Банк КАК Банк,
	|	КлассификаторБанков.Наименование КАК НаименованиеБанка,
	|	КлассификаторБанков.Код КАК БИК,
	|	КлассификаторБанков.КоррСчет КАК КоррСчет,
	|	ВТИтогиБезБИК.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТИтогиБезБИК.НомерСчета КАК НомерСчета,
	|	ВТИтогиБезБИК.ДатаОткрытияСчета КАК ДатаОткрытияСчета,
	|	ЕСТЬNULL(Организации.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(Организации.ГоловнаяОрганизация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ГоловнаяОрганизация,
	|	ВТИтогиБезБИК.ЯвляетсяМестомВыплатыЗарплаты КАК ЯвляетсяМестомВыплатыЗарплаты
	|ИЗ
	|	ВТИтогиБезБИК КАК ВТИтогиБезБИК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТИтогиБезБИК.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО ВТИтогиБезБИК.Банк = КлассификаторБанков.Ссылка";
	
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	
	БанковскиеРеквизиты = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

#КонецОбласти
